<?php

$students = ["ณัฐชา", "ชยางกูร", "ไชยวัฒน์", "วโรดม", "อภิวิชญ์", "ชานนท์", "นพดล", "ชินกฤช", "พงศ์ภรณ์", "พรเทพ", "วรชัย", "สรวิชญ์", "ไชยวัฒน์", "วงศ์วริศ", "คณิศร", "ธนวัฒน์", "แทนไท", "ปรัญชัย", "พัทธดนย์", "สัณหณัฐ", "จิรภัทร", "จิรานุวัฒน์", "สิปปกร", "อชิรวัตติ์", "ปณิทัศน์", "กันตพัฒน์", "ชุติเดช", "วชิรวิชญ์", "พุฒิเกียรติ", "ศุภโชค", "สุภาวิตา", "พิมพ์ชนก", "วรณัน", "อภิชญา", "นัทธมน", "สิรินดา", "ปภาดา", "ธัญชนก", "กัญญวรา", "นภัสสร"];


for ($i = 0; $i < count($students); $i++) {
    echo "นักเรียนที่ " . ($i + 1) . ": " . $students[$i] . "<br>";
}
?>

<?php

$students = ["ณัฐชา", "ชยางกูร", "ไชยวัฒน์", "วโรดม", "อภิวิชญ์", "ชานนท์", "นพดล", "ชินกฤช", "พงศ์ภรณ์", "พรเทพ", "วรชัย", "สรวิชญ์", "ไชยวัฒน์", "วงศ์วริศ", "คณิศร", "ธนวัฒน์", "แทนไท", "ปรัญชัย", "พัทธดนย์", "สัณหณัฐ", "จิรภัทร", "จิรานุวัฒน์", "สิปปกร", "อชิรวัตติ์", "ปณิทัศน์", "กันตพัฒน์", "ชุติเดช", "วชิรวิชญ์", "พุฒิเกียรติ", "ศุภโชค", "สุภาวิตา", "พิมพ์ชนก", "วรณัน", "อภิชญา", "นัทธมน", "สิรินดา", "ปภาดา", "ธัญชนก", "กัญญวรา", "นภัสสร"];
$i = 0;


while ($i < count($students)) {
    echo "นักเรียนที่ " . ($i + 1) . ": " . $students[$i] . "<br>";
    $i++;
}
?>

<?php

$students = ["ณัฐชา", "ชยางกูร", "ไชยวัฒน์", "วโรดม", "อภิวิชญ์", "ชานนท์", "นพดล", "ชินกฤช", "พงศ์ภรณ์", "พรเทพ", "วรชัย", "สรวิชญ์", "ไชยวัฒน์", "วงศ์วริศ", "คณิศร", "ธนวัฒน์", "แทนไท", "ปรัญชัย", "พัทธดนย์", "สัณหณัฐ", "จิรภัทร", "จิรานุวัฒน์", "สิปปกร", "อชิรวัตติ์", "ปณิทัศน์", "กันตพัฒน์", "ชุติเดช", "วชิรวิชญ์", "พุฒิเกียรติ", "ศุภโชค", "สุภาวิตา", "พิมพ์ชนก", "วรณัน", "อภิชญา", "นัทธมน", "สิรินดา", "ปภาดา", "ธัญชนก", "กัญญวรา", "นภัสสร"];
$index = 1;


foreach ($students as $student) {
    echo "นักเรียนที่ " . $index . ": " . $student . "<br>";
    $index++;
}
?>
